agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
#include "pendant_cloud.h"

#include <errno.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include <modem/lte_lc.h>
#include <modem/modem_key_mgmt.h>
#include <modem/nrf_modem_lib.h>
#include <nrf_modem_at.h>
#include <zephyr/fs/fs.h>
#include <zephyr/kernel.h>
#include <zephyr/net/socket.h>
#include <zephyr/net/tls_credentials.h>
#include <fcntl.h>
#include <zephyr/posix/arpa/inet.h>
#include <zephyr/posix/fcntl.h>
#include <zephyr/posix/netdb.h>
#include <zephyr/posix/sys/socket.h>
#include <zephyr/posix/unistd.h>
#include <zephyr/sys/atomic.h>
#include <zephyr/sys/printk.h>
#include <zephyr/sys/util.h>

/* Owned by main.c; lets the reply poll react to Button 1. */
extern struct k_sem button_press_sem;

volatile bool pendant_cloud_reply_first_batch;

/* Periodic attach diagnostics while lte_lc_connect() blocks (up to
 * CONFIG_LTE_NETWORK_TIMEOUT). +CEREG: 0 not-reg, 1 home, 2 searching,
 * 3 denied, 5 roaming. %XSIM: 1 = SIM OK.
 */
static void lte_attach_probe_fn(struct k_work *work);
static K_WORK_DELAYABLE_DEFINE(lte_attach_probe_work, lte_attach_probe_fn);
static uint32_t lte_attach_probe_count;
static int64_t lte_attach_started_ms;
static atomic_t lte_attach_probe_active;

static void lte_attach_probe_fn(struct k_work *work)
{
	char at_buf[240];
	int64_t elapsed_s =
		(k_uptime_get() - lte_attach_started_ms) / 1000;

	ARG_UNUSED(work);
	if (!atomic_get(&lte_attach_probe_active)) {
		return;
	}
	++lte_attach_probe_count;
	printk("LTE attach waiting… t=%llds probe=%u timeout=%us\n",
	       elapsed_s, lte_attach_probe_count,
	       (unsigned int)CONFIG_LTE_NETWORK_TIMEOUT);

	if (nrf_modem_at_cmd(at_buf, sizeof(at_buf), "AT+CEREG?") == 0) {
		printk("LTE probe reg: %s", at_buf);
	}
	if (nrf_modem_at_cmd(at_buf, sizeof(at_buf), "AT%%XSIM?") == 0) {
		printk("LTE probe SIM (post-CFUN, authoritative): %s", at_buf);
	}
	if (nrf_modem_at_cmd(at_buf, sizeof(at_buf), "AT%%XICCID") == 0) {
		printk("LTE probe iccid: %s", at_buf);
	} else {
		printk("LTE probe iccid: not ready\n");
	}
	if (nrf_modem_at_cmd(at_buf, sizeof(at_buf), "AT+CESQ") == 0) {
		printk("LTE probe signal: %s", at_buf);
	}
	if (nrf_modem_at_cmd(at_buf, sizeof(at_buf), "AT%%XMONITOR") == 0) {
		printk("LTE probe cell: %s", at_buf);
	}
	if (atomic_get(&lte_attach_probe_active)) {
		k_work_schedule(&lte_attach_probe_work, K_SECONDS(5));
	}
}

#define RELAY_HOSTNAME \
	"ai-pendant-relay.evan20050827.workers.dev"
#define RELAY_PORT "443"
#define TRANSCRIBE_PATH "/v1/transcribe"
#define MAC_PLAN_PATH "/v1/mac/plan"
#define PENDANT_EVENT_PATH_PREFIX "/v1/pendant/jobs/"
#define PENDANT_EVENT_PATH_SUFFIX "/events"
#define PENDANT_DEVICE_ID "nrf9160-pendant"

#define TLS_SECURITY_TAG 193
#define TLS_VERIFY_REQUIRED 2
/* Sized for JSON status + short transcript (not multi-MB bodies). */
#define HTTP_RESPONSE_SIZE 2048U
#define HTTP_HEADER_SIZE 768U
#define FILE_READ_SIZE 384U
#define BASE64_SEND_SIZE 512U
#define TRANSCRIPT_JSON_SIZE 1024U
#define JOB_ID_SIZE 80U
#define PLAN_SUFFIX_SIZE 416U
#define PENDANT_EVENT_BODY_SIZE 512U
#define HTTP_STREAM_HEADER_SIZE 1536U
#define HTTP_STREAM_READ_SIZE 1536U
#define MAX_PCM_BYTES (8U * 1024U * 1024U)
#define AGENT_REPLY_POLL_ATTEMPTS 30U

static const char relay_ca_certificate[] = {
#include "globalsign_root_ca.pem.inc"
	0x00
};

static const char transcription_prefix[] = "{\"audioBase64\":\"";
static const char transcription_suffix[] =
	"\",\"format\":\"ogg\",\"language\":\"en\"}";
static const char plan_prefix[] = "{\"command\":";
static const char base64_alphabet[] =
	"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";

static char http_response[HTTP_RESPONSE_SIZE];
static char transcript_json[TRANSCRIPT_JSON_SIZE];
static char transcription_job_id[JOB_ID_SIZE];
static char mac_job_id[JOB_ID_SIZE];
static char announced_job_id[JOB_ID_SIZE];
static uint8_t http_stream_buffer[HTTP_STREAM_READ_SIZE];
static bool cloud_initialized;
static bool radio_suspended;

/*
 * DNS on nRF9160 can return -11 / errno=115 (EINPROGRESS/EAGAIN) after RF
 * churn or when the modem's resolver is wedged. Cache the last working IPv4
 * and keep Cloudflare anycast bootstraps for this worker hostname so a voice
 * cycle still reaches the relay when getaddrinfo fails.
 *
 * When DNS has failed recently, prefer cache/bootstrap before another slow
 * getaddrinfo cycle so live prewarm and SD fallback still open a TLS socket.
 */
static struct in_addr relay_cached_ip;
static bool relay_cached_valid;
static bool relay_dns_unreliable;
static const char *const relay_bootstrap_ips[] = {
	"104.21.85.125",
	"172.67.205.183",
};

/* Live chunked PCM upload session (one TLS socket for the whole utterance). */
static int stream_fd = -1;
static bool stream_active;
static uint32_t stream_sample_rate;
static uint32_t stream_bytes_sent;
static int64_t stream_started_ms;
/*
 * Half-open chunked POST (headers sent, body pending) dies after idle:
 * dual-capture saw Live TX pump failed: -104 (ECONNRESET) ~79s after
 * prewarm with live_sent=0. Refresh idle sockets and re-validate at press.
 */
/*
 * Cloudflare kills the half-open chunked POST after ~20s idle, so refresh at
 * 10s — before death, not after — to shrink the dead-socket window a press
 * can land in. The press-time threshold sits above the refresh cadence so a
 * healthy just-refreshed socket (age ≤ ~13s with reopen time) is never torn
 * down at the exact moment the user starts speaking.
 */
#define STREAM_MAX_IDLE_MS 12000
#define STREAM_STALE_AT_START_MS 15000
/* Non-blocking TX: one in-flight HTTP chunk framing + body + CRLF. */
#define STREAM_PENDING_MAX 1200U
static uint8_t stream_pending[STREAM_PENDING_MAX];
static size_t stream_pending_len;
static size_t stream_pending_off;
static uint32_t stream_pump_calls;
static uint32_t stream_eagain_count;
/* Fully sent HTTP body chunks (not merely queued). */
static uint32_t stream_chunks_completed;

volatile int pendant_cloud_init_result = -EAGAIN;
volatile int pendant_cloud_transcribe_result = -EAGAIN;
volatile int pendant_cloud_dispatch_result = -EAGAIN;
volatile int pendant_cloud_reply_result = -EAGAIN;
volatile int pendant_cloud_last_http_status;
volatile uint32_t pendant_cloud_uploaded_pcm_bytes;
volatile uint32_t pendant_cloud_reply_pcm_bytes;
volatile uint32_t pendant_cloud_reply_sample_rate = 24000U;
volatile enum pendant_cloud_audio_format pendant_cloud_reply_format =
	PENDANT_CLOUD_AUDIO_UNKNOWN;

BUILD_ASSERT(sizeof(relay_ca_certificate) < KB(4),
	     "Relay root certificate unexpectedly large");

static int send_all(int fd, const void *data, size_t length)
{
	const uint8_t *bytes = data;
	size_t offset = 0U;

	while (offset < length) {
		ssize_t sent = send(fd, bytes + offset, length - offset, 0);

		if (sent < 0) {
			if (errno == EINTR) {
				continue;
			}
			return -errno;
		}
		if (sent == 0) {
			return -ECONNRESET;
		}
		offset += (size_t)sent;
	}

