agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
	return 0;
}

static int provision_relay_certificate(void)
{
	bool exists = false;
	int error = modem_key_mgmt_exists(
		TLS_SECURITY_TAG, MODEM_KEY_MGMT_CRED_TYPE_CA_CHAIN, &exists);

	if (error != 0) {
		return error;
	}

	if (exists) {
		error = modem_key_mgmt_cmp(
			TLS_SECURITY_TAG, MODEM_KEY_MGMT_CRED_TYPE_CA_CHAIN,
			relay_ca_certificate, sizeof(relay_ca_certificate));
		if (error == 0) {
			printk("Relay CA certificate already provisioned\n");
			return 0;
		}

		error = modem_key_mgmt_delete(
			TLS_SECURITY_TAG, MODEM_KEY_MGMT_CRED_TYPE_CA_CHAIN);
		if (error != 0) {
			return error;
		}
	}

	error = modem_key_mgmt_write(
		TLS_SECURITY_TAG, MODEM_KEY_MGMT_CRED_TYPE_CA_CHAIN,
		relay_ca_certificate, sizeof(relay_ca_certificate));
	if (error == 0) {
		printk("Relay CA certificate provisioned\n");
	}
	return error;
}

static int configure_tls_socket(int fd)
{
	const sec_tag_t security_tags[] = { TLS_SECURITY_TAG };
	int verify = TLS_VERIFY_REQUIRED;
	int error;

	error = setsockopt(fd, SOL_TLS, TLS_PEER_VERIFY,
			   &verify, sizeof(verify));
	if (error != 0) {
		return -errno;
	}

	error = setsockopt(fd, SOL_TLS, TLS_SEC_TAG_LIST,
			   security_tags, sizeof(security_tags));
	if (error != 0) {
		return -errno;
	}

	error = setsockopt(fd, SOL_TLS, TLS_HOSTNAME,
			   RELAY_HOSTNAME, sizeof(RELAY_HOSTNAME) - 1U);
	if (error != 0) {
		return -errno;
	}

#if defined(TLS_SESSION_CACHE)
	/*
	 * Session resumption is the difference between a ~0.5 s second
	 * connect and a full ~2–10 s handshake on LTE-M. The previous guard
	 * required TLS_SESSION_CACHE_ENABLED to also be *defined*, but that
	 * symbol is a value (1), not a feature flag — so the option never
	 * applied. Always request caching when the socket API supports it.
	 */
	{
		int session_cache = TLS_SESSION_CACHE_ENABLED;

		if (setsockopt(fd, SOL_TLS, TLS_SESSION_CACHE,
			       &session_cache, sizeof(session_cache)) != 0) {
			printk("TLS session cache not accepted (errno=%d)\n",
			       errno);
		}
	}
#endif

	return 0;
}

static void relay_cache_store(const struct sockaddr *addr)
{
	if (addr == NULL || addr->sa_family != AF_INET) {
		return;
	}
	relay_cached_ip = ((const struct sockaddr_in *)addr)->sin_addr;
	relay_cached_valid = true;
}

/* Seed cache from bootstrap anycast so the first call is never DNS-only. */
static void relay_cache_seed_bootstrap(void)
{
	struct in_addr ip;

	if (relay_cached_valid) {
		return;
	}
	if (inet_pton(AF_INET, relay_bootstrap_ips[0], &ip) == 1) {
		relay_cached_ip = ip;
		relay_cached_valid = true;
		printk("Relay DNS cache seeded with bootstrap %s\n",
		       relay_bootstrap_ips[0]);
	}
}

static int ensure_lte_data_ready(void)
{
	enum lte_lc_nw_reg_status status = LTE_LC_NW_REG_UNKNOWN;
	int error;

	if (radio_suspended) {
		error = pendant_cloud_resume_radio();
		if (error != 0) {
			printk("LTE resume before socket failed: %d\n", error);
			return error;
		}
	}

	error = lte_lc_nw_reg_status_get(&status);
	if (error != 0) {
		printk("LTE reg status query failed: %d (continuing)\n", error);
		return 0;
	}
	if (status == LTE_LC_NW_REG_REGISTERED_HOME ||
	    status == LTE_LC_NW_REG_REGISTERED_ROAMING) {
		return 0;
	}

	printk("LTE not registered (status=%d); reconnecting for relay DNS\n",
	       (int)status);
	error = lte_lc_connect();
	if (error != 0) {
		printk("LTE reconnect failed: %d\n", error);
	}
	return error;
}

/*
 * Try one IPv4 candidate with TLS, then plain TCP diagnostic on failure.
 * On success stores the address in the DNS cache and returns the fd (>=0).
 */
static int try_relay_ipv4(const struct in_addr *ip, unsigned int attempt,
			  unsigned int candidate_number,
			  const char *source, int64_t lat_socket_started,
			  int *last_error)
{
	struct sockaddr_in sa;
	char address[INET_ADDRSTRLEN] = "?";
	int fd;
	int error;
	int64_t lat_tls_started;

	memset(&sa, 0, sizeof(sa));
	sa.sin_family = AF_INET;
	sa.sin_port = htons(443);
	sa.sin_addr = *ip;
	(void)inet_ntop(AF_INET, ip, address, sizeof(address));
	printk("Relay DNS candidate %u.%u (%s): %s\n", attempt,
	       candidate_number, source, address);

	fd = socket(AF_INET, SOCK_STREAM, IPPROTO_TLS_1_2);
	if (fd < 0) {
		*last_error = -errno;
		printk("Relay socket attempt %u.%u failed: %d errno=%d\n",
		       attempt, candidate_number, *last_error, errno);
		return *last_error;
	}

	lat_tls_started = k_uptime_get();
	error = configure_tls_socket(fd);
	if (error == 0 &&
	    connect(fd, (struct sockaddr *)&sa, sizeof(sa)) == 0) {
		printk("Relay TLS connected on attempt %u.%u (%s %s)\n",
		       attempt, candidate_number, source, address);
		printk("LAT tls_connect_ms=%lld socket_total_ms=%lld\n",
		       k_uptime_get() - lat_tls_started,
		       k_uptime_get() - lat_socket_started);
		relay_cache_store((struct sockaddr *)&sa);
		/* A working connect via bootstrap does not prove DNS is healthy. */
		if (strcmp(source, "dns") == 0) {
			relay_dns_unreliable = false;
		}
		return fd;
	}

	*last_error = error != 0 ? error : -errno;
	printk("Relay TLS attempt %u.%u failed: %d (errno=%d source=%s)\n",
	       attempt, candidate_number, *last_error, errno, source);
	close(fd);

	/* Distinguish routing failure from TLS/credential failure. */
	fd = socket(AF_INET, SOCK_STREAM, IPPROTO_TCP);
	if (fd >= 0) {
		error = connect(fd, (struct sockaddr *)&sa, sizeof(sa));
		printk("Relay plain TCP diagnostic %u.%u: %s (errno=%d)\n",
		       attempt, candidate_number,
		       error == 0 ? "connected" : "failed", errno);
		close(fd);
	}
	return *last_error;
}

static int try_relay_bootstrap_list(unsigned int attempt_tag,
				    int64_t lat_socket_started,
				    int *last_error,
				    bool skip_cached_ip)
{
	for (unsigned int i = 0U; i < ARRAY_SIZE(relay_bootstrap_ips); ++i) {
		struct in_addr ip;
		int error;

		if (inet_pton(AF_INET, relay_bootstrap_ips[i], &ip) != 1) {
			continue;
		}
		if (skip_cached_ip && relay_cached_valid &&
		    memcmp(&ip, &relay_cached_ip, sizeof(ip)) == 0) {
			continue;
		}
		error = try_relay_ipv4(&ip, attempt_tag, i + 1U, "bootstrap",
				       lat_socket_started, last_error);
		if (error >= 0) {
			return error;
		}
	}
	return *last_error < 0 ? *last_error : -EHOSTUNREACH;
}

static int open_relay_socket(void)
{
	struct addrinfo hints = {
		.ai_family = AF_INET,
		.ai_socktype = SOCK_STREAM,
	};
	int last_error = -EHOSTUNREACH;
	int ready;
	int64_t lat_socket_started = k_uptime_get();
	const unsigned int dns_attempts = relay_dns_unreliable ? 1U : 3U;

