agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
const char *pendant_cloud_api_key(void)
{
	return CONFIG_PENDANT_RELAY_API_KEY;
}

void pendant_cloud_copy_device_time(char *out, size_t out_size)
{
	copy_device_time(out, out_size);
}

/*
 * Chunked raw PCM voice command: one TLS session, HTTP/1.1 Transfer-Encoding
 * chunked, relay wraps s16le → WAV for STT/multimodal + Mac dispatch.
 * Content-Length is unknown at open time so capture can stream live.
 */
static int send_pendant_command_chunked_header(int fd, uint32_t sample_rate)
{
	char header[HTTP_HEADER_SIZE + 192];
	char device_time[32];
	char device_time_line[64];

	copy_device_time(device_time, sizeof(device_time));
	if (device_time[0] != '\0') {
		(void)snprintf(device_time_line, sizeof(device_time_line),
			       "X-Device-Time: %s\r\n", device_time);
	} else {
		device_time_line[0] = '\0';
	}
	int length = snprintf(
		header, sizeof(header),
		"POST /v1/pendant/command?dispatch=1 HTTP/1.1\r\n"
		"Host: %s\r\n"
		"Authorization: Bearer %s\r\n"
		/* Opus at ~16 kbps: measured real-world LTE-M here sustains
		 * only 24-55 kbps each way, which starves even 64 kbps u-law.
		 * Wire format: 2-byte BE length-prefixed raw Opus packets. */
		"Content-Type: audio/opus\r\n"
		"Transfer-Encoding: chunked\r\n"
		"X-Device-Id: %s\r\n"
		"X-Audio-Format: opus-frames\r\n"
		"X-Sample-Rate: %u\r\n"
		"X-Audio-Channels: 1\r\n"
		"%s"
		/* Conversational reply: the relay transcodes the model's voice
		 * to length-prefixed Opus packets down this same connection. */
		"X-Reply-Stream: opus\r\n"
		"Connection: close\r\n\r\n",
		RELAY_HOSTNAME, CONFIG_PENDANT_RELAY_API_KEY,
		PENDANT_DEVICE_ID, sample_rate, device_time_line);

	if (length < 0 || (size_t)length >= sizeof(header)) {
		return -EOVERFLOW;
	}
	return send_all(fd, header, (size_t)length);
}

/* Known-length fallback for post-capture file upload of raw PCM. */
static int send_pendant_command_pcm_header(int fd, size_t content_length,
					   uint32_t sample_rate)
{
	char header[HTTP_HEADER_SIZE + 128];
	int length = snprintf(
		header, sizeof(header),
		"POST /v1/pendant/command?dispatch=1 HTTP/1.1\r\n"
		"Host: %s\r\n"
		"Authorization: Bearer %s\r\n"
		"Content-Type: audio/pcm\r\n"
		"Content-Length: %lu\r\n"
		"X-Device-Id: %s\r\n"
		"X-Audio-Format: pcm\r\n"
		"X-Sample-Rate: %u\r\n"
		"X-Audio-Channels: 1\r\n"
		"X-Audio-Bits: 16\r\n"
		"X-Pcm-Bytes: %lu\r\n"
		"Connection: close\r\n\r\n",
		RELAY_HOSTNAME, CONFIG_PENDANT_RELAY_API_KEY,
		(unsigned long)content_length, PENDANT_DEVICE_ID, sample_rate,
		(unsigned long)content_length);

	if (length < 0 || (size_t)length >= sizeof(header)) {
		return -EOVERFLOW;
	}
	return send_all(fd, header, (size_t)length);
}

static int socket_set_nonblock(int fd, bool enable)
{
	int flags = fcntl(fd, F_GETFL, 0);

	if (flags < 0) {
		return -errno;
	}
	if (enable) {
		flags |= O_NONBLOCK;
	} else {
		flags &= ~O_NONBLOCK;
	}
	if (fcntl(fd, F_SETFL, flags) != 0) {
		return -errno;
	}
	return 0;
}

/*
 * Advance non-blocking send of stream_pending. Returns 0 when fully sent,
 * -EAGAIN if more work remains, or a hard error.
 */
static int stream_pending_pump(int64_t deadline_ms)
{
	while (stream_pending_off < stream_pending_len) {
		ssize_t sent;

		if (k_uptime_get() >= deadline_ms) {
			++stream_eagain_count;
			return -EAGAIN;
		}
		sent = send(stream_fd, stream_pending + stream_pending_off,
			    stream_pending_len - stream_pending_off, 0);
		if (sent < 0) {
			if (errno == EINTR) {
				continue;
			}
			if (errno == EAGAIN || errno == EWOULDBLOCK) {
				++stream_eagain_count;
				return -EAGAIN;
			}
			return -errno;
		}
		if (sent == 0) {
			return -ECONNRESET;
		}
		stream_pending_off += (size_t)sent;
	}
	stream_pending_len = 0U;
	stream_pending_off = 0U;
	++stream_chunks_completed;
	return 0;
}

static int stream_queue_http_chunk(const void *data, size_t length)
{
	char chunk_header[16];
	int header_length;
	size_t total;

	if (length == 0U) {
		return 0;
	}
	if (stream_pending_len != 0U) {
		return -EBUSY;
	}

	header_length = snprintf(chunk_header, sizeof(chunk_header), "%x\r\n",
				 (unsigned int)length);
	if (header_length < 0 || (size_t)header_length >= sizeof(chunk_header)) {
		return -EOVERFLOW;
	}
	total = (size_t)header_length + length + 2U;
	if (total > sizeof(stream_pending)) {
		return -EMSGSIZE;
	}

	memcpy(stream_pending, chunk_header, (size_t)header_length);
	memcpy(stream_pending + (size_t)header_length, data, length);
	stream_pending[(size_t)header_length + length] = '\r';
	stream_pending[(size_t)header_length + length + 1U] = '\n';
	stream_pending_len = total;
	stream_pending_off = 0U;
	return 0;
}

static int send_http_chunk_end(int fd)
{
	/* Final chunk must go out reliably; briefly restore blocking. */
	(void)socket_set_nonblock(fd, false);
	return send_all(fd, "0\r\n\r\n", 5U);
}

static int copy_transcript_json_string(void);
static int copy_json_string_value(const char *key, char *output,
				  size_t output_size);

static int finalize_command_response(void)
{
	int error;

	error = copy_transcript_json_string();
	if (error != 0) {
		pendant_cloud_transcribe_result = error;
		return error;
	}

	/* Prefer nested job.jobId from /v1/pendant/command; fall back to jobId. */
	if (copy_json_string_value("jobId", mac_job_id, sizeof(mac_job_id)) ==
	    0) {
		(void)strncpy(transcription_job_id, mac_job_id,
			      sizeof(transcription_job_id) - 1U);
		transcription_job_id[sizeof(transcription_job_id) - 1U] = '\0';
		pendant_cloud_dispatch_result = 0;
		printk("Transcript queued for Mac job %s (live PCM stream)\n",
		       mac_job_id);
		return 0;
	}

	pendant_cloud_dispatch_result = -ENOTCONN;
	printk("PCM upload ok but no Mac job was queued\n");
	return -ENOTCONN;
}

static int send_http_get_header(int fd, const char *path)
{
	char header[HTTP_HEADER_SIZE];
	int length = snprintf(
		header, sizeof(header),
		"GET %s HTTP/1.1\r\n"
		"Host: %s\r\n"
		"Authorization: Bearer %s\r\n"
		"Accept: audio/ogg, audio/pcm, application/json\r\n"
		"Connection: close\r\n\r\n",
		path, RELAY_HOSTNAME, CONFIG_PENDANT_RELAY_API_KEY);

	if (length < 0 || (size_t)length >= sizeof(header)) {
		return -EOVERFLOW;
	}
	return send_all(fd, header, (size_t)length);
}

struct base64_stream {
	int fd;
	uint8_t carry[3];
	uint8_t carry_length;
	char output[BASE64_SEND_SIZE];
	size_t output_length;
};

static int base64_flush(struct base64_stream *stream)
{
	int error;

