agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
	if (stream->output_length == 0U) {
		return 0;
	}
	error = send_all(stream->fd, stream->output, stream->output_length);
	if (error == 0) {
		stream->output_length = 0U;
	}
	return error;
}

static int base64_emit(struct base64_stream *stream, uint8_t count)
{
	const uint8_t byte0 = stream->carry[0];
	const uint8_t byte1 = count > 1U ? stream->carry[1] : 0U;
	const uint8_t byte2 = count > 2U ? stream->carry[2] : 0U;

	if (stream->output_length + 4U > sizeof(stream->output)) {
		int error = base64_flush(stream);

		if (error != 0) {
			return error;
		}
	}

	stream->output[stream->output_length++] =
		base64_alphabet[byte0 >> 2];
	stream->output[stream->output_length++] =
		base64_alphabet[((byte0 & 0x03U) << 4) | (byte1 >> 4)];
	stream->output[stream->output_length++] =
		count > 1U
			? base64_alphabet[((byte1 & 0x0fU) << 2) |
					  (byte2 >> 6)]
			: '=';
	stream->output[stream->output_length++] =
		count > 2U ? base64_alphabet[byte2 & 0x3fU] : '=';
	stream->carry_length = 0U;
	return 0;
}

static int base64_feed(struct base64_stream *stream,
		       const uint8_t *data, size_t length)
{
	for (size_t index = 0U; index < length; ++index) {
		stream->carry[stream->carry_length++] = data[index];
		if (stream->carry_length == 3U) {
			int error = base64_emit(stream, 3U);

			if (error != 0) {
				return error;
			}
		}
	}
	return 0;
}

static int base64_finish(struct base64_stream *stream)
{
	int error = 0;

	if (stream->carry_length != 0U) {
		error = base64_emit(stream, stream->carry_length);
	}
	return error == 0 ? base64_flush(stream) : error;
}

/*
 * Fallback: known-length raw s16le PCM file upload on /v1/pendant/command.
 * Live capture prefers pendant_cloud_stream_* chunked path instead.
 */
static int post_recording_command(const char *audio_path,
				  uint32_t source_pcm_bytes,
				  uint32_t sample_rate)
{
	struct fs_dirent entry;
	struct fs_file_t file;
	uint8_t file_bytes[FILE_READ_SIZE];
	uint32_t bytes_read_total = 0U;
	int fd = -1;
	int error;

	error = fs_stat(audio_path, &entry);
	if (error != 0) {
		printk("Cloud upload SD stat failed for %s: %d\n",
		       audio_path, error);
		return error;
	}
	if (entry.type != FS_DIR_ENTRY_FILE || entry.size == 0U ||
	    entry.size > MAX_PCM_BYTES || source_pcm_bytes == 0U) {
		printk("Cloud upload rejected SD file: type=%u size=%u\n",
		       (unsigned int)entry.type, (uint32_t)entry.size);
		return -EINVAL;
	}
	printk("Cloud upload found %u PCM bytes on SD (fallback single-shot)\n",
	       (uint32_t)entry.size);

	int64_t lat_upload_started = k_uptime_get();

	/*
	 * open_relay_socket already retries DNS/cache/bootstrap. One extra
	 * outer attempt recovers from a transient TLS handshake glitch.
	 */
	fd = open_relay_socket();
	if (fd < 0) {
		printk("Cloud upload relay socket open failed (%d); retrying once\n",
		       fd);
		k_msleep(1000);
		fd = open_relay_socket();
	}
	if (fd < 0) {
		printk("Cloud upload could not open relay socket: %d\n", fd);
		return fd;
	}
	int64_t lat_upload_socket_done = k_uptime_get();
	printk("Cloud upload relay socket open after %lld ms (fd=%d)\n",
	       lat_upload_socket_done - lat_upload_started, fd);

	error = send_pendant_command_pcm_header(fd, (size_t)entry.size,
						sample_rate);
	if (error != 0) {
		printk("Cloud upload HTTP header failed: %d\n", error);
		goto out;
	}

	fs_file_t_init(&file);
	error = fs_open(&file, audio_path, FS_O_READ);
	if (error != 0) {
		goto out;
	}

	while (true) {
		ssize_t count = fs_read(&file, file_bytes, sizeof(file_bytes));

		if (count < 0) {
			error = (int)count;
			break;
		}
		if (count == 0) {
			break;
		}
		error = send_all(fd, file_bytes, (size_t)count);
		if (error != 0) {
			break;
		}
		bytes_read_total += (uint32_t)count;
	}
	(void)fs_close(&file);
	if (error != 0) {
		goto out;
	}
	if (bytes_read_total != entry.size) {
		error = -EIO;
		goto out;
	}

	pendant_cloud_uploaded_pcm_bytes = bytes_read_total;
	printk("Uploaded %u raw PCM bytes (fallback single-shot)\n",
	       bytes_read_total);
	int64_t lat_body_sent = k_uptime_get();

	error = receive_http_response(fd);
	printk("LAT upload socket_ms=%lld body_send_ms=%lld "
	       "server_wait_ms=%lld total_ms=%lld body_bytes=%u\n",
	       lat_upload_socket_done - lat_upload_started,
	       lat_body_sent - lat_upload_socket_done,
	       k_uptime_get() - lat_body_sent,
	       k_uptime_get() - lat_upload_started,
	       (uint32_t)entry.size);

out:
	close(fd);
	return error;
}

static int copy_transcript_json_string(void)
{
	const char *body = strstr(http_response, "\r\n\r\n");
	const char *key;
	const char *start;
	const char *cursor;
	bool escaped = false;

	if (body == NULL) {
		return -EBADMSG;
	}
	key = strstr(body + 4, "\"text\"");
	if (key == NULL) {
		return -ENODATA;
	}
	start = strchr(key + sizeof("\"text\"") - 1U, ':');
	if (start == NULL) {
		return -EBADMSG;
	}
	do {
		++start;
	} while (*start == ' ' || *start == '\t' || *start == '\r' ||
		 *start == '\n');
	if (*start != '"') {
		return -EBADMSG;
	}

	for (cursor = start + 1; *cursor != '\0'; ++cursor) {
		if (escaped) {
			escaped = false;
			continue;
		}
		if (*cursor == '\\') {
			escaped = true;
			continue;
		}
		if (*cursor == '"') {
			size_t length = (size_t)(cursor - start + 1);

			if (length >= sizeof(transcript_json)) {
				return -E2BIG;
			}
			memcpy(transcript_json, start, length);
			transcript_json[length] = '\0';
			printk("Remote transcript: %s\n", transcript_json);
			return 0;
		}
	}

	return -EBADMSG;
}

static int copy_json_string_value(const char *key_name,
				  char *destination,
				  size_t destination_size)
{
	const char *body = strstr(http_response, "\r\n\r\n");
	const char *key;
	const char *start;
	const char *end;
	char quoted_key[48];
	int key_length;

	if (body == NULL) {
		return -EBADMSG;
	}
	key_length = snprintf(quoted_key, sizeof(quoted_key), "\"%s\"",
			      key_name);
	if (key_length < 0 || (size_t)key_length >= sizeof(quoted_key)) {
		return -EOVERFLOW;
	}
	key = strstr(body + 4, quoted_key);
	if (key == NULL) {
		return -ENODATA;
	}
	start = strchr(key + key_length, ':');
	if (start == NULL) {
		return -EBADMSG;
	}
	do {
		++start;
	} while (*start == ' ' || *start == '\t' || *start == '\r' ||
		 *start == '\n');
	if (*start != '"') {
		return -EBADMSG;
	}
	++start;
	end = strchr(start, '"');
	if (end == NULL) {
		return -EBADMSG;
	}

	size_t length = (size_t)(end - start);

