agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
		if (received < 0) {
			if (errno == EINTR) {
				continue;
			}
			return -errno;
		}
		if (received == 0) {
			return 0;
		}
		reader->buffer_length = (size_t)received;
		reader->buffer_offset = 1U;
		*value = http_stream_buffer[0];
		return 1;
	}
}

static int read_required_body_byte(struct http_body_reader *reader,
				   uint8_t *value)
{
	int result = http_body_next(reader, value);

	return result > 0 ? 0 : (result == 0 ? -ECONNRESET : result);
}

static int receive_chunked_pcm(struct http_body_reader *reader,
			       struct pcm_writer *writer)
{
	while (true) {
		char size_line[24];
		size_t size_length = 0U;
		uint8_t character;
		int error;

		while (true) {
			error = read_required_body_byte(reader, &character);
			if (error != 0) {
				return error;
			}
			if (character == '\r') {
				break;
			}
			if (size_length + 1U >= sizeof(size_line)) {
				return -EOVERFLOW;
			}
			size_line[size_length++] = (char)character;
		}
		size_line[size_length] = '\0';
		error = read_required_body_byte(reader, &character);
		if (error != 0 || character != '\n') {
			return error != 0 ? error : -EBADMSG;
		}

		char *extension = strchr(size_line, ';');
		if (extension != NULL) {
			*extension = '\0';
		}
		char *end = NULL;
		unsigned long chunk_size = strtoul(size_line, &end, 16);
		if (end == size_line || *end != '\0') {
			return -EBADMSG;
		}
		if (chunk_size == 0U) {
			return 0;
		}

		for (unsigned long index = 0U; index < chunk_size; ++index) {
			error = read_required_body_byte(reader, &character);
			if (error != 0) {
				return error;
			}
			error = pcm_writer_emit(writer, character);
			if (error != 0) {
				return error;
			}
		}
		error = read_required_body_byte(reader, &character);
		if (error != 0 || character != '\r') {
			return error != 0 ? error : -EBADMSG;
		}
		error = read_required_body_byte(reader, &character);
		if (error != 0 || character != '\n') {
			return error != 0 ? error : -EBADMSG;
		}
	}
}

static int receive_fixed_pcm(struct http_body_reader *reader,
			     struct pcm_writer *writer,
			     size_t content_length)
{
	for (size_t index = 0U; index < content_length; ++index) {
		uint8_t character;
		int error = read_required_body_byte(reader, &character);

		if (error != 0) {
			return error;
		}
		error = pcm_writer_emit(writer, character);
		if (error != 0) {
			return error;
		}
	}
	return 0;
}

static int receive_close_delimited_pcm(struct http_body_reader *reader,
				       struct pcm_writer *writer)
{
	while (true) {
		uint8_t character;
		int result = http_body_next(reader, &character);

		if (result < 0) {
			return result;
		}
		if (result == 0) {
			return 0;
		}
		int error = pcm_writer_emit(writer, character);
		if (error != 0) {
			return error;
		}
	}
}

static char ascii_lower(char value)
{
	return value >= 'A' && value <= 'Z' ? value + ('a' - 'A') : value;
}

static const char *header_find_ci(const char *header, const char *needle)
{
	size_t needle_length = strlen(needle);

	for (const char *candidate = header; *candidate != '\0'; ++candidate) {
		size_t index = 0U;

		while (index < needle_length &&
		       candidate[index] != '\0' &&
		       ascii_lower(candidate[index]) ==
			       ascii_lower(needle[index])) {
			++index;
		}
		if (index == needle_length) {
			return candidate;
		}
	}
	return NULL;
}

static size_t header_decimal_value(const char *header, const char *name)
{
	const char *value = header_find_ci(header, name);

	return value == NULL ? 0U : (size_t)strtoul(value + strlen(name), NULL, 10);
}

static int receive_agent_job_speech(int fd, const char *pcm_path)
{
	char header[HTTP_STREAM_HEADER_SIZE];
	struct fs_file_t file;
	size_t header_bytes = 0U;
	char *body = NULL;
	bool file_open = false;
	int error = 0;

	while (header_bytes < sizeof(header) - 1U) {
		ssize_t received = recv(fd, header + header_bytes,
					sizeof(header) - 1U - header_bytes, 0);

		if (received < 0) {
			if (errno == EINTR) {
				continue;
			}
			return -errno;
		}
		if (received == 0) {
			return -ECONNRESET;
		}
		header_bytes += (size_t)received;
		header[header_bytes] = '\0';
		body = strstr(header, "\r\n\r\n");
		if (body != NULL) {
			break;
		}
	}
	if (body == NULL) {
		return -EOVERFLOW;
	}

	const char *status = strchr(header, ' ');
	if (status == NULL) {
		return -EBADMSG;
	}
	pendant_cloud_last_http_status = atoi(status + 1);
	printk("Agent speech HTTP status: %d\n", pendant_cloud_last_http_status);
	if (pendant_cloud_last_http_status == 202) {
		return -EAGAIN;
	}
	if (pendant_cloud_last_http_status < 200 ||
	    pendant_cloud_last_http_status >= 300) {
		return -EREMOTE;
	}
	bool is_opus =
		header_find_ci(header, "Content-Type: audio/ogg") != NULL ||
		header_find_ci(header, "X-Audio-Format: ogg-opus") != NULL;
	bool is_pcm =
		header_find_ci(header, "Content-Type: audio/pcm") != NULL ||
		header_find_ci(header, "X-Audio-Format: s16le") != NULL;

	if (!is_opus && !is_pcm) {
		return -EBADMSG;
	}
	pendant_cloud_reply_format = is_opus
		? PENDANT_CLOUD_AUDIO_OGG_OPUS
		: PENDANT_CLOUD_AUDIO_PCM_S16LE;

	size_t content_length = header_decimal_value(header, "Content-Length:");
	bool chunked =
		header_find_ci(header, "Transfer-Encoding: chunked") != NULL;
	size_t sample_rate =
		header_decimal_value(header, "X-Audio-Sample-Rate:");
	if (sample_rate != 0U) {
		pendant_cloud_reply_sample_rate = (uint32_t)sample_rate;
	}
	body += 4;
	struct http_body_reader reader = {
		.fd = fd,
		.initial = (const uint8_t *)body,
		.initial_length = header_bytes - (size_t)(body - header),
	};
	struct pcm_writer writer = {
		.file = &file,
	};

	fs_file_t_init(&file);
	error = fs_open(&file, pcm_path,
			FS_O_CREATE | FS_O_WRITE | FS_O_TRUNC);
	if (error != 0) {
		return error;
	}
	file_open = true;
	printk("Agent speech body: chunked=%u content_length=%u\n",
	       chunked ? 1U : 0U, (uint32_t)content_length);

	if (chunked) {
		error = receive_chunked_pcm(&reader, &writer);
	} else if (content_length != 0U) {
		error = receive_fixed_pcm(&reader, &writer, content_length);
	} else {
		error = receive_close_delimited_pcm(&reader, &writer);
	}
	if (error == 0) {
		error = pcm_writer_flush(&writer);
	}
	if (error == 0) {
		error = fs_sync(&file);
	}
	if (file_open) {
		int close_error = fs_close(&file);

