agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
		if (error == 0) {
			error = close_error;
		}
	}
	if (error != 0) {
		return error;
	}
	if (writer.written_bytes == 0U ||
	    (is_pcm && (writer.written_bytes & 1U) != 0U)) {
		return -EBADMSG;
	}

	/* Tiny replies: still raise LED if body finished under threshold. */
	if (!writer.first_batch_notified && writer.written_bytes > 0U) {
		writer.first_batch_notified = true;
		pendant_cloud_reply_first_batch = true;
		pendant_notify_reply_first_batch();
	}

	pendant_cloud_reply_pcm_bytes = (uint32_t)writer.written_bytes;
	printk("Downloaded %u bytes of Mac agent speech (%s)%s\n",
	       pendant_cloud_reply_pcm_bytes,
	       is_opus ? "Ogg Opus" : "PCM fallback",
	       pendant_cloud_reply_first_batch ? " [LED already solid]" : "");
	return 0;
}

int pendant_cloud_init(void)
{
	int error;

	if (cloud_initialized) {
		return 0;
	}
	if (CONFIG_PENDANT_RELAY_API_KEY[0] == '\0') {
		printk("PENDANT_RELAY_API_KEY is empty\n");
		pendant_cloud_init_result = -EACCES;
		return pendant_cloud_init_result;
	}

	printk("Initializing nRF9160 modem\n");
	error = nrf_modem_lib_init();
	if (error != 0) {
		printk("nrf_modem_lib_init failed: %d\n", error);
		goto out;
	}
	error = provision_relay_certificate();
	if (error != 0) {
		printk("Relay CA provision failed: %d\n", error);
		goto out;
	}

	/*
	 * UICC often only answers after full functionality (CFUN). Pre-attach
	 * ICCID failure is not fatal; recheck during probes. lte_lc_connect
	 * blocks up to CONFIG_LTE_NETWORK_TIMEOUT (cereg.c).
	 */
	{
		char at_buf[160];

		(void)nrf_modem_at_printf("AT+CEREG=5");
		if (nrf_modem_at_cmd(at_buf, sizeof(at_buf),
				     "AT%%XSIM?") == 0) {
			printk("SIM before CFUN (non-authoritative; %%XSIM: 0 is "
			       "expected here): %s", at_buf);
		}
		if (nrf_modem_at_cmd(at_buf, sizeof(at_buf),
				     "AT%%XICCID") == 0) {
			printk("SIM ICCID before CFUN (non-authoritative): %s",
			       at_buf);
		} else {
			printk("SIM ICCID not ready pre-attach "
			       "(will recheck during attach)\n");
		}
	}

	lte_attach_probe_count = 0U;
	lte_attach_started_ms = k_uptime_get();
	atomic_set(&lte_attach_probe_active, 1);
	k_work_schedule(&lte_attach_probe_work, K_SECONDS(3));

	printk("Attaching pendant to LTE network (timeout %us)\n",
	       (unsigned int)CONFIG_LTE_NETWORK_TIMEOUT);
	error = lte_lc_connect();
	atomic_clear(&lte_attach_probe_active);
	struct k_work_sync probe_sync;

	(void)k_work_cancel_delayable_sync(&lte_attach_probe_work, &probe_sync);
	if (error != 0) {
		bool sim_ready = false;

		printk("LTE attach failed: %d (%s).\n", error,
		       error == -ETIMEDOUT ? "timeout" : "error");
		{
			char at_buf[160];

			if (nrf_modem_at_cmd(at_buf, sizeof(at_buf),
					     "AT%%XSIM?") == 0) {
				sim_ready = strstr(at_buf, "%XSIM: 1") != NULL;
				printk("Final SIM (post-CFUN, authoritative): %s",
				       at_buf);
			}
			if (nrf_modem_at_cmd(at_buf, sizeof(at_buf),
					     "AT+CEREG?") == 0) {
				printk("Final CEREG: %s", at_buf);
			}
		}
		if (sim_ready) {
			printk("SIM is initialized; check LTE-M coverage, antenna, "
			       "APN/plan, and registration status.\n");
		} else {
			printk("SIM is not initialized post-CFUN; check the nano-SIM "
			       "seat, contacts, tray, and power.\n");
		}
		goto out;
	}
	{
		char at_buf[160];

		if (nrf_modem_at_cmd(at_buf, sizeof(at_buf), "AT%%XSIM?") == 0) {
			printk("SIM after attach (post-CFUN, authoritative): %s",
			       at_buf);
		}
		if (nrf_modem_at_cmd(at_buf, sizeof(at_buf), "AT%%XICCID") == 0) {
			printk("SIM ICCID after attach: %s", at_buf);
		}
	}

	cloud_initialized = true;
	printk("Pendant LTE connection ready (attach %lld s)\n",
	       (k_uptime_get() - lte_attach_started_ms) / 1000);

out:
	pendant_cloud_init_result = error;
	return error;
}

int pendant_cloud_suspend_radio(void)
{
	int error;

	if (!cloud_initialized || radio_suspended) {
		return 0;
	}

	printk("Powering down modem RF for deterministic microphone capture\n");
	error = lte_lc_func_mode_set(LTE_LC_FUNC_MODE_POWER_OFF);
	if (error == 0) {
		radio_suspended = true;
		/*
		 * The AT command returns before the modem's final RF/HFXO rail
		 * transition has fully settled. Starting I2S during that transition
		 * can still starve DMA about one second later.
		 */
		k_msleep(1500);
	}
	return error;
}

int pendant_cloud_resume_radio(void)
{
	int error;

	if (!radio_suspended) {
		return 0;
	}

	printk("Resuming LTE after microphone capture\n");
	error = lte_lc_func_mode_set(LTE_LC_FUNC_MODE_NORMAL);
	if (error != 0) {
		return error;
	}
	radio_suspended = false;

	printk("Reattaching pendant to LTE network\n");
	return lte_lc_connect();
}

static void stream_reset_state(void)
{
	stream_fd = -1;
	stream_active = false;
	stream_sample_rate = 0U;
	stream_bytes_sent = 0U;
	stream_started_ms = 0;
	stream_pending_len = 0U;
	stream_pending_off = 0U;
	stream_pump_calls = 0U;
	stream_eagain_count = 0U;
	stream_chunks_completed = 0U;
}

/*
 * True when the prewarmed fd still looks usable. Peer close/RST shows up as
 * POLLHUP/POLLERR. Any POLLIN on a half-open chunked POST (headers sent, body
 * not finished) means FIN/RST/unexpected response — do not reuse.
 */
static bool stream_socket_ok(void)
{
	struct zsock_pollfd pfd;
	int n;

	if (stream_fd < 0) {
		return false;
	}

	memset(&pfd, 0, sizeof(pfd));
	pfd.fd = stream_fd;
	pfd.events = ZSOCK_POLLIN;
	n = zsock_poll(&pfd, 1, 0);
	if (n < 0) {
		return false;
	}
	if ((pfd.revents & (ZSOCK_POLLIN | ZSOCK_POLLERR | ZSOCK_POLLHUP |
			    ZSOCK_POLLNVAL)) != 0) {
		return false;
	}
	return true;
}

static bool stream_is_conn_death(int error)
{
	return error == -ECONNRESET || error == -EPIPE || error == -ENOTCONN ||
	       error == -ECONNABORTED || error == -ENETRESET ||
	       error == -EHOSTUNREACH || error == -ENETUNREACH ||
	       error == -ETIMEDOUT;
}

bool pendant_cloud_stream_active(void)
{
	return stream_active;
}

bool pendant_cloud_stream_has_pending(void)
{
	return stream_pending_len != 0U;
}

uint32_t pendant_cloud_stream_bytes_sent(void)
{
	return stream_bytes_sent;
}

