agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
void pendant_cloud_stream_abort(void)
{
	if (stream_fd >= 0) {
		close(stream_fd);
	}
	stream_reset_state();
}

static int stream_open_chunked(uint32_t sample_rate)
{
	int error;

	if (sample_rate == 0U) {
		return -EINVAL;
	}
	if (!cloud_initialized) {
		error = pendant_cloud_init();
		if (error != 0) {
			return error;
		}
	}
	if (radio_suspended) {
		error = pendant_cloud_resume_radio();
		if (error != 0) {
			return error;
		}
	}

	stream_started_ms = k_uptime_get();
	error = open_relay_socket();
	if (error < 0) {
		printk("Live PCM stream socket failed (%d); retrying once\n",
		       error);
		k_msleep(500);
		error = open_relay_socket();
	}
	if (error < 0) {
		printk("Live PCM stream socket failed: %d\n", error);
		stream_reset_state();
		return error;
	}
	stream_fd = error;

	/* Headers use blocking send (idle/prewarm only). */
	error = send_pendant_command_chunked_header(stream_fd, sample_rate);
	if (error != 0) {
		printk("Live PCM stream header failed: %d\n", error);
		close(stream_fd);
		stream_reset_state();
		return error;
	}

	error = socket_set_nonblock(stream_fd, true);
	if (error != 0) {
		printk("Live PCM stream nonblock failed: %d\n", error);
		/* Continue with blocking; pump still time-bounds loops. */
	}

	stream_active = true;
	stream_sample_rate = sample_rate;
	stream_bytes_sent = 0U;
	stream_pending_len = 0U;
	stream_pending_off = 0U;
	stream_chunks_completed = 0U;
	/* stream_started_ms set above at open start — age for stale checks. */
	printk("Live PCM stream open: sample_rate=%u header_ms=%lld\n",
	       sample_rate, k_uptime_get() - stream_started_ms);
	return 0;
}

/*
 * Drop a dead/stale half-open session and open a fresh TLS+chunked stream.
 * Clears any in-flight pending frame (caller must tolerate losing that stage).
 */
static void stream_reset_job_state(void)
{
	pendant_cloud_transcribe_result = -EAGAIN;
	pendant_cloud_dispatch_result = -EAGAIN;
	pendant_cloud_reply_result = -EAGAIN;
	pendant_cloud_last_http_status = 0;
	pendant_cloud_uploaded_pcm_bytes = 0U;
	pendant_cloud_reply_pcm_bytes = 0U;
	pendant_cloud_reply_format = PENDANT_CLOUD_AUDIO_UNKNOWN;
	transcription_job_id[0] = '\0';
	mac_job_id[0] = '\0';
	announced_job_id[0] = '\0';
}

static int stream_reopen_fresh(uint32_t sample_rate, const char *reason)
{
	printk("Live PCM stream reopen (%s)\n",
	       reason != NULL ? reason : "refresh");
	if (stream_fd >= 0) {
		close(stream_fd);
	}
	stream_reset_state();
	stream_reset_job_state();
	return stream_open_chunked(sample_rate);
}

/*
 * Open TLS + chunked headers while the UI is idle so Button 1 never waits on
 * the modem handshake. Safe to call repeatedly. Refreshes aged/dead sockets so
 * a long wait between prewarm and press does not leave a RST-pending fd.
 */
int pendant_cloud_stream_prewarm(uint32_t sample_rate)
{
	int error;

	if (stream_active && stream_sample_rate == sample_rate) {
		int64_t age_ms = k_uptime_get() - stream_started_ms;
		bool ok = stream_socket_ok();

		if (age_ms < STREAM_MAX_IDLE_MS && ok) {
			return 0;
		}
		printk("Live PCM idle refresh (age_ms=%lld socket_ok=%d)\n",
		       age_ms, ok ? 1 : 0);
		error = stream_reopen_fresh(sample_rate, "idle_refresh");
	} else {
		if (stream_active) {
			pendant_cloud_stream_abort();
		}
		stream_reset_job_state();
		error = stream_open_chunked(sample_rate);
	}
	if (error == 0) {
		printk("Live PCM stream prewarmed (idle)\n");
	}
	return error;
}

/*
 * Call at button press before I2S starts. Reopens if the idle prewarm is
 * stale or the modem socket already shows POLLHUP/RST.
 */
int pendant_cloud_stream_ensure(uint32_t sample_rate)
{
	int error;

	if (stream_active && stream_sample_rate == sample_rate) {
		int64_t age_ms = k_uptime_get() - stream_started_ms;
		bool ok = stream_socket_ok();

		if (age_ms < STREAM_STALE_AT_START_MS && ok) {
			stream_reset_job_state();
			printk("Live PCM stream ready at press (age_ms=%lld)\n",
			       age_ms);
			return 0;
		}
		printk("Live PCM stream not ready at press "
		       "(age_ms=%lld socket_ok=%d); reopening\n",
		       age_ms, ok ? 1 : 0);
		error = stream_reopen_fresh(sample_rate, "press_ensure");
	} else {
		if (stream_active) {
			pendant_cloud_stream_abort();
		}
		stream_reset_job_state();
		error = stream_open_chunked(sample_rate);
	}
	if (error == 0) {
		printk("Live PCM stream ensured at press\n");
	} else {
		printk("Live PCM stream ensure failed: %d\n", error);
	}
	return error;
}

int pendant_cloud_stream_begin(uint32_t sample_rate)
{
	return pendant_cloud_stream_ensure(sample_rate);
}

int pendant_cloud_stream_pump(uint32_t budget_ms)
{
	int64_t deadline;
	int error;

	++stream_pump_calls;
	if (!stream_active || stream_fd < 0) {
		return -ENOTCONN;
	}
	if (stream_pending_len == 0U) {
		return 0;
	}
	deadline = k_uptime_get() + (int64_t)budget_ms;
	error = stream_pending_pump(deadline);
	/*
	 * Do not TLS-reopen here: I2S only has ~123 ms of RX slab headroom and
	 * a modem handshake can take hundreds of ms to seconds. Stale sockets
	 * are handled by idle prewarm refresh + ensure-at-press.
	 */
	if (error != 0 && error != -EAGAIN && stream_is_conn_death(error)) {
		printk("Live PCM pump conn death: %d chunks_done=%u "
		       "pending_off=%u (SD backup if armed)\n",
		       error, stream_chunks_completed,
		       (unsigned int)stream_pending_off);
	}
	return error;
}

int pendant_cloud_stream_write(const void *data, size_t length)
{
	int error;

	if (!stream_active || stream_fd < 0) {
		return -ENOTCONN;
	}
	if (data == NULL || length == 0U) {
		return 0;
	}
	if (stream_bytes_sent + length > MAX_PCM_BYTES) {
		return -EFBIG;
	}
	/* Must finish previous chunk framing before queueing another. */
	if (stream_pending_len != 0U) {
		return -EAGAIN;
	}

	error = stream_queue_http_chunk(data, length);
	if (error != 0) {
		return error;
	}
	/* Bytes are committed once framed; pump may finish later. */
	stream_bytes_sent += (uint32_t)length;
	return 0;
}

/*
 * Inline (conversational) reply: after the terminal upload chunk the relay
 * answers with the model's spoken PCM on this same connection. State below
 * lets main pull the dechunked body at playback pace.
 */
static bool reply_inline_active;
static bool reply_inline_chunked;
static bool reply_inline_eof;
static size_t reply_inline_fixed_remaining;
static unsigned long reply_chunk_remaining;
static struct http_body_reader reply_reader;
/* Chunk-size-line accumulator persists across -EAGAIN (non-blocking play). */
static char reply_sizeline[24];
static size_t reply_sizeline_length;

static void header_copy_value(const char *header, const char *name,
			      char *out, size_t out_size)
{
	out[0] = '\0';
	const char *at = header_find_ci(header, name);

	if (at == NULL) {
		return;
	}
	at += strlen(name);
	while (*at == ' ') {
		++at;
	}
	size_t index = 0U;
	while (at[index] != '\0' && at[index] != '\r' && at[index] != '\n' &&
	       index + 1U < out_size) {
		out[index] = at[index];
		++index;
	}
	out[index] = '\0';
}

