agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
/*
 * Read the response status line + headers from the live stream socket.
 * Returns PENDANT_CLOUD_REPLY_INLINE when an audio/pcm body follows (socket
 * stays open for pendant_cloud_reply_read), 0 for a classic JSON response
 * (rest of the body is accumulated into http_response as before), <0 error.
 */
static int receive_stream_response_start(int fd)
{
	size_t offset = 0U;
	char *body = NULL;

	while (offset < sizeof(http_response) - 1U) {
		ssize_t received = recv(fd, http_response + offset,
					sizeof(http_response) - 1U - offset, 0);

		if (received < 0) {
			if (errno == EINTR) {
				continue;
			}
			return -errno;
		}
		if (received == 0) {
			break;
		}
		offset += (size_t)received;
		http_response[offset] = '\0';
		body = strstr(http_response, "\r\n\r\n");
		if (body != NULL) {
			break;
		}
	}
	http_response[offset] = '\0';

	const char *status = strchr(http_response, ' ');

	if (status == NULL) {
		return -EBADMSG;
	}
	pendant_cloud_last_http_status = atoi(status + 1);

	const bool inline_audio =
		body != NULL && pendant_cloud_last_http_status >= 200 &&
		pendant_cloud_last_http_status < 300 &&
		(header_find_ci(http_response, "Content-Type: audio/pcm") !=
			 NULL ||
		 header_find_ci(http_response, "Content-Type: audio/opus") !=
			 NULL);

	if (inline_audio) {
		const bool ulaw_reply =
			header_find_ci(http_response,
				       "Content-Type: audio/pcmu") != NULL;
		const bool opus_reply =
			header_find_ci(http_response,
				       "Content-Type: audio/opus") != NULL;
		size_t rate = header_decimal_value(http_response,
						   "X-Audio-Sample-Rate:");

		pendant_cloud_reply_format =
			opus_reply ? PENDANT_CLOUD_AUDIO_OPUS_FRAMES
			: ulaw_reply ? PENDANT_CLOUD_AUDIO_G711_ULAW
				     : PENDANT_CLOUD_AUDIO_PCM_S16LE;
		if (opus_reply) {
			/* Wire packets carry 16 kHz speech; the on-device
			 * decoder outputs 24 kHz regardless of this header. */
			pendant_cloud_reply_sample_rate = 24000U;
		} else if (rate != 0U) {
			pendant_cloud_reply_sample_rate = (uint32_t)rate;
		} else if (ulaw_reply) {
			/* G.711 is defined at 8 kHz. */
			pendant_cloud_reply_sample_rate = 8000U;
		}
		header_copy_value(http_response, "X-Job-Id:", mac_job_id,
				  sizeof(mac_job_id));
		reply_inline_chunked =
			header_find_ci(http_response,
				       "Transfer-Encoding: chunked") != NULL;
		reply_inline_fixed_remaining = header_decimal_value(
			http_response, "Content-Length:");
		body += 4;
		reply_reader = (struct http_body_reader){
			.fd = fd,
			.initial = (const uint8_t *)body,
			.initial_length =
				offset - (size_t)(body - http_response),
		};
		reply_chunk_remaining = 0U;
		reply_sizeline_length = 0U;
		reply_inline_eof = false;
		reply_inline_active = true;
		printk("Inline reply stream: rate=%u chunked=%u job=%s\n",
		       pendant_cloud_reply_sample_rate,
		       reply_inline_chunked ? 1U : 0U,
		       mac_job_id[0] != '\0' ? mac_job_id : "(pending)");
		return PENDANT_CLOUD_REPLY_INLINE;
	}

	/* Classic JSON: read the remainder until close, as before. */
	while (offset < sizeof(http_response) - 1U) {
		ssize_t received = recv(fd, http_response + offset,
					sizeof(http_response) - 1U - offset, 0);

		if (received < 0) {
			if (errno == EINTR) {
				continue;
			}
			return -errno;
		}
		if (received == 0) {
			break;
		}
		offset += (size_t)received;
	}
	http_response[offset] = '\0';
	printk("Relay HTTP status: %d, response bytes: %u\n",
	       pendant_cloud_last_http_status, (uint32_t)offset);
	if (pendant_cloud_last_http_status < 200 ||
	    pendant_cloud_last_http_status >= 300) {
		const char *error_body = strstr(http_response, "\r\n\r\n");

		printk("Relay error: %s\n",
		       error_body == NULL ? "(no body)" : error_body + 4);
		return -EREMOTE;
	}
	return 0;
}

int pendant_cloud_reply_read(void *buffer, size_t length)
{
	uint8_t *out = buffer;
	size_t filled = 0U;

	if (!reply_inline_active) {
		return -ENOTCONN;
	}
	if (reply_inline_eof) {
		return 0;
	}

	while (filled < length) {
		uint8_t value;
		int status;

		if (reply_inline_chunked) {
			if (reply_chunk_remaining == 0U) {
				/* Chunk-size line (plus closing CRLF of the
				 * previous chunk when one was consumed). */
				bool line_done = false;

				while (!line_done) {
					status = http_body_next(&reply_reader,
								&value);
					if (status == -EAGAIN) {
						return filled > 0U
							       ? (int)filled
							       : -EAGAIN;
					}
					if (status <= 0) {
						reply_inline_eof = true;
						return filled > 0U
							       ? (int)filled
							       : status;
					}
					if (value == '\n') {
						line_done =
							reply_sizeline_length >
							0U;
						continue;
					}
					if (value == '\r') {
						continue;
					}
					if (reply_sizeline_length + 1U >=
					    sizeof(reply_sizeline)) {
						reply_inline_eof = true;
						return -EOVERFLOW;
					}
					reply_sizeline[reply_sizeline_length++] =
						(char)value;
				}
				reply_sizeline[reply_sizeline_length] = '\0';

				char *end = NULL;
				reply_chunk_remaining =
					strtoul(reply_sizeline, &end, 16);
				const bool bad_size = end == reply_sizeline;

				reply_sizeline_length = 0U;
				if (bad_size) {
					reply_inline_eof = true;
					return -EBADMSG;
				}
				if (reply_chunk_remaining == 0U) {
					reply_inline_eof = true;
					return (int)filled;
				}
			}
			status = http_body_next(&reply_reader, &value);
			if (status == -EAGAIN) {
				return filled > 0U ? (int)filled : -EAGAIN;
			}
			if (status <= 0) {
				reply_inline_eof = true;
				return filled > 0U ? (int)filled : status;
			}
			--reply_chunk_remaining;
			out[filled++] = value;
		} else {
			if (reply_inline_fixed_remaining == 0U) {
				/* Close-delimited body: read until EOF. */
			}
			status = http_body_next(&reply_reader, &value);
			if (status == -EAGAIN) {
				return filled > 0U ? (int)filled : -EAGAIN;
			}
			if (status <= 0) {
				reply_inline_eof = true;
				/* status==0 is clean EOF; a socket error with
				 * nothing buffered must NOT read as an empty
				 * reply played "successfully". */
				return filled > 0U ? (int)filled : status;
			}
			out[filled++] = value;
			if (reply_inline_fixed_remaining > 0U &&
			    --reply_inline_fixed_remaining == 0U) {
				reply_inline_eof = true;
				return (int)filled;
			}
		}
	}
	return (int)filled;
}

/* Playback drains the reply without blocking so the jitter ring, not the
 * 85 ms I2S queue, absorbs LTE burst gaps. */
int pendant_cloud_reply_set_nonblocking(bool enable)
{
	if (stream_fd < 0) {
		return -ENOTCONN;
	}
	return socket_set_nonblock(stream_fd, enable);
}

void pendant_cloud_reply_stream_close(void)
{
	reply_inline_active = false;
	reply_inline_eof = true;
	if (stream_fd >= 0) {
		close(stream_fd);
		stream_fd = -1;
	}
	stream_active = false;
	stream_reset_state();
}

int pendant_cloud_stream_end(void)
{
	int error;
	int64_t body_done_ms;
	int64_t drain_deadline;

