agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
	if (!stream_active || stream_fd < 0) {
		return -ENOTCONN;
	}

	/* Drain any in-flight chunk (budget up to 5 s). */
	drain_deadline = k_uptime_get() + 5000;
	while (stream_pending_len != 0U) {
		error = stream_pending_pump(drain_deadline);
		if (error == -EAGAIN) {
			if (k_uptime_get() >= drain_deadline) {
				printk("Live PCM stream drain timeout\n");
				pendant_cloud_stream_abort();
				pendant_cloud_transcribe_result = -ETIMEDOUT;
				return -ETIMEDOUT;
			}
			continue;
		}
		if (error != 0) {
			printk("Live PCM stream drain failed: %d\n", error);
			pendant_cloud_stream_abort();
			pendant_cloud_transcribe_result = error;
			return error;
		}
	}

	error = send_http_chunk_end(stream_fd);
	if (error != 0) {
		printk("Live PCM stream end-chunk failed: %d\n", error);
		pendant_cloud_stream_abort();
		pendant_cloud_transcribe_result = error;
		return error;
	}

	pendant_cloud_uploaded_pcm_bytes = stream_bytes_sent;
	body_done_ms = k_uptime_get();
	printk("Live PCM stream body complete: bytes=%u stream_ms=%lld "
	       "pumps=%u eagain=%u\n",
	       stream_bytes_sent, body_done_ms - stream_started_ms,
	       stream_pump_calls, stream_eagain_count);

	(void)socket_set_nonblock(stream_fd, false);
	{
		/* Header wait bounds SERVER THINK TIME (model turn + tool run
		 * + first speech byte), not link liveness — a web_search chain
		 * alone can pass 15s. Body reads tighten to 15s below once
		 * audio is actually streaming. */
		struct timeval receive_timeout = {
			.tv_sec = 30,
			.tv_usec = 0,
		};
		(void)setsockopt(stream_fd, SOL_SOCKET, SO_RCVTIMEO,
				 &receive_timeout, sizeof(receive_timeout));
	}
	error = receive_stream_response_start(stream_fd);
	printk("LAT live_stream server_wait_ms=%lld total_ms=%lld "
	       "body_bytes=%u HTTP=%d\n",
	       k_uptime_get() - body_done_ms,
	       k_uptime_get() - stream_started_ms, stream_bytes_sent,
	       pendant_cloud_last_http_status);

	if (error == PENDANT_CLOUD_REPLY_INLINE) {
		/*
		 * The model's spoken reply is arriving on this socket; main
		 * pulls it via pendant_cloud_reply_read and closes with
		 * pendant_cloud_reply_stream_close. The Mac job (if any) was
		 * dispatched server-side from the tool call. Deltas flow
		 * continuously once speech starts, so a mid-body recv may
		 * use a tighter bound than the header wait above.
		 */
		struct timeval body_timeout = {
			.tv_sec = 15,
			.tv_usec = 0,
		};
		(void)setsockopt(stream_fd, SOL_SOCKET, SO_RCVTIMEO,
				 &body_timeout, sizeof(body_timeout));
		pendant_cloud_transcribe_result = 0;
		pendant_cloud_dispatch_result = 0;
		return PENDANT_CLOUD_REPLY_INLINE;
	}

	close(stream_fd);
	stream_fd = -1;
	stream_active = false;

	pendant_cloud_transcribe_result = error;
	if (error != 0) {
		stream_reset_state();
		return error;
	}

	error = finalize_command_response();
	stream_reset_state();
	return error;
}

int pendant_cloud_upload_recording(const char *audio_path,
				   uint32_t source_pcm_bytes,
				   uint32_t sample_rate)
{
	int error;

	if (stream_active) {
		pendant_cloud_stream_abort();
	}

	pendant_cloud_transcribe_result = -EAGAIN;
	pendant_cloud_dispatch_result = -EAGAIN;
	pendant_cloud_reply_result = -EAGAIN;
	pendant_cloud_last_http_status = 0;
	pendant_cloud_uploaded_pcm_bytes = 0U;
	pendant_cloud_reply_pcm_bytes = 0U;
	pendant_cloud_reply_format = PENDANT_CLOUD_AUDIO_UNKNOWN;
	transcription_job_id[0] = '\0';
	mac_job_id[0] = '\0';
	announced_job_id[0] = '\0';

	if (!cloud_initialized) {
		error = pendant_cloud_init();
		if (error != 0) {
			return error;
		}
	}

	/*
	 * Fallback: one TLS session, raw PCM file, relay STT + Mac queue.
	 */
	error = post_recording_command(audio_path, source_pcm_bytes,
				       sample_rate);
	pendant_cloud_transcribe_result = error;
	if (error != 0) {
		return error;
	}

	return finalize_command_response();
}

int pendant_cloud_wait_for_agent_reply(const char *pcm_path)
{
	char path[192];
	int error;

	pendant_cloud_reply_result = -EAGAIN;
	pendant_cloud_reply_pcm_bytes = 0U;
	pendant_cloud_reply_format = PENDANT_CLOUD_AUDIO_UNKNOWN;
	pendant_cloud_reply_first_batch = false;
	if (!cloud_initialized || mac_job_id[0] == '\0') {
		pendant_cloud_reply_result = -ENODATA;
		return pendant_cloud_reply_result;
	}

	int length = snprintf(
		path, sizeof(path),
		"/v1/pendant/jobs/%s/speech?waitMs=25000",
		mac_job_id);

	if (length < 0 || (size_t)length >= sizeof(path)) {
		pendant_cloud_reply_result = -EOVERFLOW;
		return pendant_cloud_reply_result;
	}

	for (unsigned int attempt = 1U;
	     attempt <= AGENT_REPLY_POLL_ATTEMPTS; ++attempt) {
		int fd = open_relay_socket();

		if (fd < 0) {
			error = fd;
			continue;
		}
		error = send_http_get_header(fd, path);
		if (error == 0) {
			error = receive_agent_job_speech(fd, pcm_path);
		}
		close(fd);

		if (error == 0) {
			pendant_cloud_reply_result = 0;
			int event_error = post_pendant_event(
				"reply_downloaded", "done",
				"Reply downloaded to pendant",
				"Agent response audio was written to microSD.",
				0);

			if (event_error != 0) {
				printk("Reply telemetry failed: %d\n",
				       event_error);
			}
			return 0;
		}
		if (error != -EAGAIN) {
			break;
		}
		/* A button press abandons the reply so a new recording can
		 * start immediately instead of riding out the full poll.
		 */
		if (k_sem_take(&button_press_sem, K_NO_WAIT) == 0) {
			pendant_cloud_reply_result = -ECANCELED;
			return -ECANCELED;
		}
		printk("Agent reply is not ready; polling again (%u/%u)\n",
		       attempt, AGENT_REPLY_POLL_ATTEMPTS);
		/* ~1 s wait; cancel if the user presses the button. */
		for (unsigned int slice = 0U; slice < 10U; ++slice) {
			if (k_sem_take(&button_press_sem, K_MSEC(100)) == 0) {
				pendant_cloud_reply_result = -ECANCELED;
				return -ECANCELED;
			}
		}
	}

	pendant_cloud_reply_result = error;
	return error;
}

int pendant_cloud_report_playback_started(void)
{
	return post_pendant_event(
		"device_playback", "active",
		"Bluetooth playback started",
		"Pendant started transmitting response PCM over I2S.",
		0);
}

int pendant_cloud_report_playback_result(int playback_result)
{
	if (playback_result == 0) {
		return post_pendant_event(
			"device_playback", "done",
			"Bluetooth playback completed",
			"Pendant finished transmitting response PCM over I2S.",
			0);
	}

	return post_pendant_event(
		"device_playback", "failed",
		"Bluetooth playback failed",
		"Pendant I2S playback returned an error.",
		playback_result);
}

int pendant_cloud_set_job_id_for_diagnostic(const char *job_id)
{
	size_t length;

	if (job_id == NULL) {
		return -EINVAL;
	}
	length = strlen(job_id);
	if (length == 0U || length >= sizeof(mac_job_id)) {
		return -EINVAL;
	}
	memcpy(mac_job_id, job_id, length + 1U);
	return 0;
}
